{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_22": {"name": "keras_tensor_22:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25088"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "keras_tensor_22", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/add", "op": "_FusedConv2D", "input": ["keras_tensor_22", "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Reshape"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_6_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_8_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_6_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Relu", "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Reshape"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_7_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_9_1/add"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_7_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Relu", "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_8_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_10_1/add"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_8_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Relu", "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape", "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "shape": [25088, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "shape": [128, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Add/ReadVariableOp", "shape": [5], "dtype": "float32"}]}]}